# sudo apt install git - установка системы контроля версий (кода)

# git - cистема контроля версий - программа для управления версиями кода

# github - сервис для хранения кода

# репозиторий - папка с которой может взаимодействовать git

# git init - превращает текущую директорию в git репозиторий
# git status - проверка статуса репозитория
# git add <file_name> / git add . - добавить файлы к отслеживанию изменений
# git commit -m "комментарий к версии" - сохранения версии кода / создание коммита
# git remote add <название-переменной>(принято называть "origin") <ссылка-на-удаленный-репозиторий> - соединение локального репозитория с удаленным
# git push <название-переменной> <название-ветки> - отправка версии на github

# git clone ссылка-на-удаленный-репозиторий - скачать/склонить проект

# git branch - просмотр текущей ветки
# git branch <имя-для-ветки> - создание новой ветки
# git checkout <имя-ветки> - переключится на другую ветку